[
  {
    "filename": "SG_aug25bill.pdf",
    "type": "pdf",
    "content": "*P2018913125889*   *00000000.00*  (5442910)   604-000827-00414-2347  Billing Period   Bill Date   Account Type   Deposit  06 Jul 2025 - 05 Aug 2025   06 Aug 2025   Domestic   $100.00  For cheque payment: Crossed cheque is to be made payable to ‘ SP Services Ltd ’. Please detach and mail this portion with your cheque to   'SP Services Ltd, Privy Box No. 920277, Singapore 929292' . (No receipt will be issued. Please do not send post-dated cheque.)  Payment Due:   Total Amount Payable:  20 Aug 2025   $0.00  Please make full payment by the due date to avoid $0.50 Pink Notice Fee and 1% Late Payment Charge.  Account No   Cheque No   Bank:  8913125889   Branch:  SP Services Ltd: Co. Registration No. (199504470N) | GST Registration No. (M2-8920920-4)   For details on difference between current charges and total amount payable, see Summary of Charges  This is your tax invoice for  41840352558-/S   604-000827-00414-2347  000000000000 8913125889  Page 1 of 2  August 2025 Bill  Account No. 8913125889  MDM NATARAJAN JEYALAKSHMI 291D COMPASSVALE ST #04-266 SINGAPORE 544291  291D COMPASSVALE ST #04-266 SINGAPORE 544291  Total Amount Payable:   $0.00  Payment Due:   20 Aug 2025  Current Charges   Consumption Trend   Total  Usage  Electricity Services  Usage: 166 kWh  $45.60  (kWh) MAR 173 APR* 179 MAY 93 JUN 16 JUL 110 AUG 166  - - - -   433  -------   355  Usage  Gas Services  by City Energy Pte. Ltd. (as Trustee of City Energy Trust) Usage: 67 kWh  $14.93  (kWh) MAR 162 APR* 141 MAY 8 JUN 0 JUL 46 AUG* 67  - - - -   75  -------   62  Usage  Water Services  by Public Utilities Board Usage: 5.7 Cu M  $18.44  (Cu M) MAR 21.7 APR* 19.2 MAY 4.5 JUN* 12.6 JUL -1.1 AUG* 5.7  - - - -   17.7  -------   15.0  - - - -   Neighbour average   -----------   National average   *Estimated month  Utilities Saving Tip  Brush teeth using a mug instead of running water.  Find out more utilities saving tips at www.spgroup.com.sg  Refuse Removal  by SembWaste Pte Ltd   $9.36  GST   $7.94  Current Charges:  (Inclusive of GST)   $96.27\n41840352558-/S   604-000828-00414-2347 Page 2 of 2  August 2025 Bill  Account No. 8913125889  Different payment options with SP Services  GIRO  Set up eGIRO via SP app or SP Utilities Portal.  PayNow QR  Generate a QR code unique to your account on the SP app or at our SP Utilities Portal to pay your bill.  S elf Help Machines  At AXS Stations and DBS/POSB/OCBC ATMs.  SP app  View and pay your bills via the app.  .   Debit/Credit cards (VISA, MasterCard, AMEX)  Internet Banking  Select \"SP Services\" as the Billing Organisation at your bank's portal.  Counter P ayment  Cash, NETS, CashCard payments can be made at 7-Eleven stores. Find out other payment options at www.spgroup.com.sg  We may, from time to time, contact you to obtain feedback or inform you about the services and offers of SP Services and its trusted partners. If you do not wish to be contacted, please inform us. Please visit www.spgroup.com.sg to read our T&Cs.  Summary of Charges  Balance Brought Forward from Previous Bill   -$98.78 Payment Received   $0.00 Outstanding Balance   -$98.78 Current Charges due on 20 Aug 2025 (Wed)   $96.27  This amount will be used to offset your next bill   -$2.51  Summary of U-Save  Opening Balance   -$72.28 U-Save Used   $72.28 Closing Balance   $0.00  Breakdown of Current Charges   Usage   Rate ($)   Amount ($)   Total ($)  Electricity Services  Meter Reading taken : 313   166 kWh   0.2747   45.60   45.60  Gas Services   by City Energy Pte. Ltd. (as Trustee of City Energy Trust)  Usage estimated   67 kWh   0.2228   14.93   14.93  Water Services   by Public Utilities Board  Usage estimated   5.7 Cu M   1.4300   8.15 Waterborne Tax   5.7 Cu M   1.0900   6.21 Water Conservation Tax   $8.15   50%   4.08   18.44  Refuse Removal   by SembWaste Pte Ltd   1 Qty   9.36   9.36   9.36  Subtotal   88.33   88.33  GST   $88.33   9%   7.94   7.94  Current Charges:  (Inclusive of GST)   $96.27  Meter Reading  l   Your meter reading(s) will be taken between 31 Aug 2025 and 06 Sep 2025.  Notices  l   Payment received on or after 05 Aug 2025 may not be included in this bill.  Contact Information  Scan here to update your contact details and access more e-services on the SP app.  Customer Service Centre  490 Lorong 6 Toa Payoh #09-11, HDB Hub Biz Three Lift Lobby 1, Singapore 310490  General Enquiries:   1800 222 2333  Payment Arrangement:   6671 7100  Emergency Numbers  Electricity:   1800 778 8888  Water:   1800 225 5782 (CALL PUB)  Gas:   1800 752 1800  This bill serves as a tax invoice for the collection of: - Electricity charges for SP Services Ltd and SP PowerAssets Ltd (200302108D) or Tuas Power Supply Pte Ltd (200004985K) or Sembcorp Power Pte Ltd (199707557R) or Singapore Institute of Technology (200917667D) - Gas charges for City Energy Pte. Ltd. (as Trustee of City Energy Trust) (M90356440A) - Water charges, NEWater charges, water conservation tax and waterborne tax for the Public Utilities Board (MB-8100014-4) - Refuse removal fee for SembWaste Pte Ltd (M2-8922032-1) or Veolia ES Singapore P L (199804675H) or Colex Environmental Pte Ltd (201133348M) or 800 Super Waste Management Pte Ltd (M2-0073013-5) or TEE Environmental Pte. Ltd. (200106873W) or ALBA W&H SmartCity Pte Ltd (201938124E) - Chilled Water charges for SP Home Cooling Pte. Ltd. (201924654M) The amount for GST shown on the bill is calculated based on the sum of the GST charged for each individual item.",
    "pages": 2
  },
  {
    "filename": "cbetneb.pdf",
    "type": "pdf",
    "content": "TAMILNADU POWER DISTRIBUTION CORPORATION LIMITED  Registered Office : No:144, NPKRR Maaligai, Anna Salai, Chennai - 600 002  Tax Invoice for LT Current Consumption Charges for the Month of July 2025  Section   B.UNIVERSITY Circle   CBE-North Distribution   VIJAY NAGAR Servie Connection Number   03-112-010-2764  Name/Address & GST of the Consumer  N JEYALAKSHMI  ,Villa.No.28,Sree Daksha S Naruvi,Vadavalli,Perur  State: TAMILNADU   State Code   33 Consumer GST No:  Pay This Bill By Online in  https://www.tnebnet.org/qwp/qpay  GSTN No:   33AADCT4784E1ZC Invoice No: L430250744706719 / Date: 26/07/2025 Tariff Applied   LA1A   Sanctioned Load   13.0 KW Phase   3 phase   Invoice Type   INVOICE CT/Non-CT   Non-CT   Place of Supply   Tamil Nadu Meter No:   6072630   Supply Type   Regular Solar RTS   NO   Reverse Charge   NO Welding   NO   Billing Cycle   Bi-Monthly Bill Period   24/05/2025- 26/07/2025   ä ‹ d f «  94987 94987  Bill Amount   Rs.813/-  Due Date  18/08/2025  Energy Consumption :   Final Reading   Initial Reading   MF   Consumption [After MF & DT Loss] : Max Dmd Recorded   Max Dmd Recorded with MF Power Factor Recorded  READING   4705.0   4382.0   1   323.0   2.60   2.6   0.0 DATE   26/07/2025   24/05/2025 STATUS   Normal   Normal  SAVE ELECTRICITY  SECURITY DEPOSIT Balance as of 01-04-2024   8642.00 Interest Credited on above after TDS   583.00 Collection During the Year   0.00 Refund made in the Year   0.00 Balance as of   26/07/2025   9225.00 MCD as of   26/07/2025   2700.00 OLD ARREARS /CREDITS Particulars   Period   Amount Total   -   0.00 ADVANCE CC ACCOUNT Balance as of 24/05/2025   0.00 Collection During the Period   0.00 Interest Allowed   0.00 Adjusted   (including this Bill)   0.00 Balance as of 26/07/2025   0.00 PARTICULARS   HSN/SAC   Base Amount Rs.   CGST @9%   SGST @9%   Invoice Amount Rs. Energy Charges   2716 0000   1570.40   1570.40 Fixed Charges   2716 0000 Sub Total (a)   1570.40   1570.40 Less: Govt Subsidy   2716 0000   -757.29   -757.29 Sub Total (b)   -757.29   -757.29 Welding Sur Chr   996 912 Excess MD Charges   996 912 Penalty for LPF   996 912 Net Work Charges   998 631 Sub Total (c)   0.00   0.00   0.00   0.00 Electricity Tax TCS /TDS [u/s 206(1C)]   0.00   0.00   0.00   0.00 Sub Total (d)   0.00   0.00   0.00   0.00 Other Charges   996 912 ASD Demand Old Arrears Sub Total (e)   0.00   0.00   0.00   0.00 Less: Adjustments Advance CC Adj Refund Of SD Sub Total (f)   0.00   0.00   0.00   0.00 Round off (g)   -0.11   -0.11  Net Payable Amt   (a+b+c+d+e-f+g)   813.00   0.00   0.00   813.00  (Rupees:Eight hundred Thirteen only)  Note:1.Bill amount shall be payable within the due date to avoid disconnection as per Sec 56(1) of Electricity Act 2003. 2.Payment after due date will attract belated payment surcharge and other charges as applicable 3.This is system generated invoice.Does not require signature  Acronyms:  TDS - Tax Deducted at Source:   MCD – Meter Caution Deposit   ASD – Additional Security Deposit TCS - Tax collected at source   SAC - Services Accounting Codes   SD – Security Deposit CC – Current Consumption   MF – Multiple Factor   MD – Maximum Demand HSN – Harmonized System of Nomenclature   LPF – Low Power Factor   RTS – Roof Top Solar GST - Goods and Services Tax   CT – Current Transformer   LT - Low Tension   Asst Engineer/B.UNIVERSITY",
    "pages": 1
  },
  {
    "filename": "orlandowaterbill.jpeg",
    "type": "image",
    "content": "Image file - requires OCR for text extraction",
    "pages": 1
  },
  {
    "filename": "orlbill.pdf",
    "type": "pdf",
    "content": "Page 1 of 3  duke-energy.com  800.700.8744  9100 7871 3664  Your Energy Bill  Service address   Bill date  Account number Aug 15, 2025 30   days  For service   Jul 15 - Aug 13 RAMAKRISHNAN NAMMUNDI 436 ALPINE ST ALTAMONTE SPG FL 32701  Billing summary  Previous Amount Due   $286.23  Payment Received Aug 06   -286.23  Current Electric Charges   275.27  Taxes   15.30  Total Amount Due Sep 05   $290.57  Your usage snapshot  Electric usage history  kWh   2024   2025  0 227 454 681 908 1134 1361 1588 1815 2042  Aug   Sep   Oct   Nov   Dec   Jan   Feb   Mar   Apr   May   Jun   Jul   Aug  Average temperature in degrees  83 o   81 o   75 o   71 o   63 o   56 o   67 o   68 o   74 o   79 o   81 o   83 o   83 o  Current Month   Aug 2024   12-Month Usage   Avg Monthly Usage  Electric (kWh)   1,564   1,696   16,088   1,341 Avg. Daily (kWh)   52   53   44 12-month usage based on most recent history  Thank you for your payment. Duke Energy Florida utilized fuel in the following proportions to generate your power: Coal 7.3%, Purchased Power 2.8%, Gas 82.9%, Oil 0.1%, Nuclear 0%, Solar 6.9% (For prior 12 months ending June 30, 2025). With EnergyWise Home, saving on your monthly electric bill has never been easier. Get up to $141 in annual bill credits by enrolling your qualifying appliances at duke-energy.com/save141  Please return this portion with your payment. Thank you for your business.  Account number  Mail your payment at least 7 days before the due date   or pay instantly at duke-energy.com/billing. Late payments are subject to a $5.00 or 1.5%, late charge, whichever is greater.  Amount of automatic draft  $290.57  by Sep 5  Your payment is scheduled to be made by monthly automatic draft on Sep 5  Duke Energy Return Mail PO Box 1090 Charlotte, NC 28201-1090  RAMAKRISHNAN NAMMUNDI  88910078713664000660000000000000002905700000290572  9100 7871 3664  436 ALPINE ST ALTAMONTE SPG FL 32701-7802  Duke Energy Payment Processing  PO Box 1094 Charlotte, NC 28201-1094  Add here, to help others with a contribution to Share the Light  $_____________________   $_________________ Amount enclosed\nPage 2 of 3  9100 7871 3664 Account number duke-energy.com 800.700.8744   200763945980  We're here for you  Report an emergency  Electric outage   duke-energy.com/outages 800.228.8485  Convenient ways to pay your bill  Online Automatically from your bank account Speedpay (fee applies) By mail payable to Duke Energy In person duke-energy.com/billing duke-energy.com/automatic-draft duke-energy.com/pay-now 800.700.8744 P.O. Box 1094 Charlotte, NC 28201-1094 duke-energy.com/location  Help managing your account   (not applicable for all customers) Register for free paperless billing Home Business duke-energy.com/paperless duke-energy.com/manage-home duke-energy.com/manage-bus  General questions or concerns  Online Home: Mon - Fri (7 a.m. to 7 p.m.) Business: Mon - Fri (7 a.m. to 6 p.m.) For hearing impaired TDD/TTY International duke-energy.com 800.700.8744 877.372.8477 711 1.407.629.1010  Call before you dig  Call   800.432.4770 or 811  Check utility rates  Check rates and charges   duke-energy.com/rates  Correspond with Duke Energy   (not for payment) P.O. Box 14042 St Petersburg, FL 33733  Important to know Your next meter reading on or after: Sep 12  Please be sure we can safely access your meter. Don't worry if your digital meter flashes eights from time to time. That's a normal part of the energy measuring process.  Your electric service may be disconnected if your payment is past due  If payment for your electric service is past due, we may begin disconnection procedures. The due date on your bill applies to current charges only. Any unpaid, past due charges are not extended to the new due date and may result in disconnection.  Electric service does not depend on payment for other products or services  Non-payment for non-regulated products or services (such as surge protection or equipment service contracts) may result in removal from the program but will not result in disconnection of electric service.  When you pay by check  We may process the payment as a regular check or convert it into a one-time electronic check payment.  Asset Securitization Charge  A charge to recover cost associated with nuclear asset-recovery bonds. Duke Energy Florida is acting as the collection agent for Special Purpose Entity (SPE) until the bonds have been paid in full or legally discharged.  Medical Essential Program  Identifies customers who are dependent on continuously electric-powered medical equipment. The program does not automatically extend electric bill due dates, nor does it provide priority restoration. To learn more or find out if you qualify, call 800.700.8744 or visit duke- energy.com/home/billing/special-assistance/ medically-essential.  Special Needs Customers  Florida Statutes offer a program for customers who need special assistance during emergency evacuations and sheltering. Customers with special needs may contact their local emergency management agency for registration and more information.  Para nuestros clientes que hablan Español  Representantes bilingües están disponibles para asistirle de lunes a viernes de 7 a.m. - 7 p.m. Para obtener más información o reportar problemas con su servicio eléctrico, favor de llamar al 800.700.8744.\nPage 3 of 3  9100 7871 3664 Account number duke-energy.com 800.700.8744  Your usage snapshot - Continued  Current electric usage for meter number 3720592  Actual reading on Aug 13   99587 Previous reading on Jul 15   - 98023 Energy Used   1,564 kWh Billed kWh   1,564.000 kWh  A kilowatt-hour (kWh) is a measure of the energy used by a 1,000- watt appliance in one hour. A 10-watt LED lightbulb would take 100 hours to use 1 kWh.  Billing details - Electric  Billing Period - Jul 15 25 to Aug 13 25 Meter - 3720592  Customer Charge   $13.83 Energy Charge 1,000.000 kWh @ 12.219c   122.19 Energy Charge 564.000 kWh @ 12.959c   73.09 Fuel Charge 1,000.000 kWh @ 3.630c   36.30 Fuel Charge 564.000 kWh @ 4.700c   26.51 Asset Securitization Charge 1,564.000 kWh @ 0.214c   3.35  Total Current Charges   $275.27  Your current rate is Residential Service (RS-1). For a complete listing of all Florida rates and riders, visit duke- energy.com/rates  Billing details - Taxes  Regulatory Assessment Fee   $0.24 Gross Receipts Tax   7.06 County Utility Tax   8.00  Total Taxes   $15.30",
    "pages": 3
  },
  {
    "filename": "toronto_gas.pdf",
    "type": "pdf",
    "content": "P a g e 1 o f 2  S M E L L   G A S ?   1 - 8 6 6 - 7 6 3 - 5 4 2 7   F o r   I n q u i r i e s : 1 - 8 7 7 - 3 6 2 - 7 4 3 4   e n b r i d g e g a s . c o m / o n t a r i o  M a k e   P a y m e n t s   t o : P O B o x 6 4 4 S c a r b o r o u g h , O N M 1 K 5 H 1  E n b r i d g e   G a s   I n c .  W H A T   D O   I   O W E ?  • S e e p a g e 2 f o r d e t a i l s •  C h a r g e s   f o r   N a t u r a l   G a s  B i l l i n g   P e r i o d J u l 1 3 , 2 0 2 5 - A u g 1 3 , 2 0 2 5  T o t a l   A m o u n t  $  3 7 . 3 2  ( T a x e s I n c l u d e d )  W i t h d r a w n   O n S e p   0 4 ,   2 0 2 5  H O W   M U C H   G A S   D I D   I   U S E ?  M e t e r   R e a d i n g  E s t i m a t e d :  P r e v i o u s :  3 6 1 7 8 7 0  6 2 4 9  6 2 2 8  M e t e r   N u m b e r :  2 1 m ³  a p p r o x . 0 . 6 6 m ³ p e r d a y  Y o u   u s e d  $  3 7 . 3 2  a p p r o x . $  1 . 1 7 p e r d a y  T h i s   c o s t   y o u  A c c o u n t   N u m b e r   B i l l   D a t e  S e r v i c e   A d d r e s s R I T H E S H   K U M A R  4 0   C A R N A T I O N   A V E  T H   1 0 7  E T O B I C O K E   O N   M 8 V   0 B 8  4 0 C A R N A T I O N A V E T H 1 0 7 E T O B I C O K E O N M 8 V 0 B 8  9 1 0 0 6 4 2 5 2 2 3 0   A u g 1 5 , 2 0 2 5  *   H S T R e g i s t r a t i o n N u m b e r : 1 0 5 2 0 5 1 4 0 R T 0 0 0 1 -   E n b r i d g e G a s c h a r g e s a r e t o b e p a i d b y t h e D u e D a t e , w h i c h i s c o n s i d e r e d t o b e t w e n t y d a y s a f t e r t h e B i l l D a t e , o r w i t h i n s u c h o t h e r t i m e p e r i o d a s s e t o u t i n t h e S e r v i c e C o n t r a c t . A l a t e p a y m e n t c h a r g e w i l l b e a p p l i e d o n a n y a m o u n t n o t r e c e i v e d b y t h e D u e D a t e , -   w h i c h i s t h e t w e n t i e t h ( 2 0 t h ) d a y f o l l o w i n g t h e B i l l D a t e . I n t e r e s t w i l l b e c h a r g e d a t t h e r a t e o f 1 . 5 0 % p e r m o n t h ( e f f e c t i v e a n n u a l r a t e 1 9 . 5 6 % p e r a n n u m o r 0 . 0 4 8 9 6 % c o m p o u n d e d d a i l y r a t e ) u n t i l r e c e i p t o f a l l o f t h e u n p a i d E n b r i d g e G a s c h a r g e s , i n c l u d i n g a l l -   a p p l i c a b l e f e d e r a l a n d p r o v i n c i a l t a x e s . -   E . & O . E . -   P E F V a l u e : 1 . 0 0 4 0 0  2 0 2 4   2 0 2 5  Y o u r a v e r a g e m o n t h l y u s e i s l e s s t h i s y e a r t h a n l a s t y e a r . C h o o s e e B i l l t o a c c e s s y o u r l a s t 2 4 b i l l s :  e n b r i d g e g a s . c o m / e b i l l  D i d   y o u   k n o w ?  2 2 m ³   2 1 m ³  M Y   L A S T   1 3   M O N T H S   G A S   U S E  ( I n m ³ ) 22.0 3.0 20.0   19.0 66.0 93.0 107.0 59.0   63.0 3.0 21.0 7.0 21.0  Aug 24   Sep 24   Oct 24   Nov 24   Dec 24   Jan 25   Feb 25   Mar 25   Apr 25   May 25   Jun 25   Jul 25   Aug 25\nP a g e 2 o f 2  S M E L L   G A S ?   1 - 8 6 6 - 7 6 3 - 5 4 2 7   F o r   I n q u i r i e s : 1 - 8 7 7 - 3 6 2 - 7 4 3 4   e n b r i d g e g a s . c o m / o n t a r i o  M a k e   P a y m e n t s   t o : P O B o x 6 4 4 S c a r b o r o u g h , O N M 1 K 5 H 1  E n b r i d g e   G a s   I n c .  W H A T   A M   I   P A Y I N G   F O R ?  B i l l i n g   P e r i o d J u l 1 3 , 2 0 2 5 - A u g 1 3 , 2 0 2 5  B a l a n c e f r o m P r e v i o u s B i l l   $ 5 6 . 0 7  P a y m e n t R e c e i v e d [ A u g 0 5 , 2 0 2 5 ]   $ 5 6 . 0 7 C R  B a l a n c e F o r w a r d   $ 0 . 0 0  C h a r g e s f o r N a t u r a l G a s   $ 3 7 . 3 2  T o t a l   A m o u n t   D u e   $ 3 7 . 3 2  C H A R G E S   F O R   N A T U R A L   G A S  J u l   1 3 ,   2 0 2 5   -   A u g   1 3 ,   2 0 2 5  C u s t o m e r C h a r g e   $ 2 6 . 7 4  D e l i v e r y t o Y o u   $ 2 . 7 9  T r a n s p o r t a t i o n t o E n b r i d g e   $ 1 . 2 2  G a s S u p p l y C h a r g e   $ 2 . 7 4  C o s t A d j u s t m e n t   $ 0 . 4 6 C R  C h a r g e s   f o r   N a t u r a l   G a s   $ 3 3 . 0 3  H S T *   $ 4 . 2 9  T o t a l   C h a r g e s   f o r   N a t u r a l   G a s   $ 3 7 . 3 2  Y o u r g a s s u p p l y r a t e  G a s c o s t a d j u s t m e n t  J u l 0 1 / 2 5 - J u n 3 0 / 2 6  1 3 . 0 3 6 2 ¢ / m ³  - 2 . 7 6 2 3 ¢ / m ³  1 0 . 2 7 3 9 ¢ / m ³ T o t a l e f f e c t i v e g a s s u p p l y r a t e  N A T U R A L   G A S   S U P P L Y",
    "pages": 2
  },
  {
    "filename": "torontobill.pdf",
    "type": "pdf",
    "content": "Customer   Account   Number  Due   Date   Amount   Enclosed Amount   Due  Service   Address  Bill   Date  Meter   Number   Adjust. factor  Power factor Units  Adjusted Usage Usage Mult  Reads  Billing Days  Read   Dates  Present   Previous   Code   Previous Present  132   W alsh   Road,   Lindsay ,   ON   K9V   4R3 Customer   Service:   1.888.298.3336  -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -  Service   Address Name Account   Number CARMA   Corp.  TEL:   1-888-298-3336   40   CARNA TION   A VE   107 RITHESH   KUMAR   &   JASMEET 00933799-1 1  **   P .A.P .   DO   NOT   P A Y   **  **   REGULAR   **  1.5%   per   month   late   penalty   on   overdue   accounts  07/30/2025  RITHESH   KUMAR   &   JASMEET   KAUR   T AAK  40   CARNA TION   A VE  UNIT   107  T ORONT O   ON   M8V   0B8  40   CARNA TION   A VE   107  164.37 08/20/2025  00933799-1 1  MESSAGES:  IMPORT ANT   -   Potential   Postal   Strike   –   Canada   Post services   may   be   interrupted   due   to   ongoing   labour   negotiations between   Canada   Post   and   the   Canadian   Union   of   Postal W orkers   (CUPW),   as   Canada   Post   workers   may   be   in   a position   to   strike.   A   potential   strike   could   af fect   the   delivery   of your   monthly   CARMA   bill   by   mail. T o   avoid   delays   in   receiving   your   bill   or   making   payments, please   visit   our   website   at   https://carmabilling.idoxs.ca/,   where you   can   access   your   e-bills   and   make   payments   online. Thank   you   for   your   understanding   and   cooperation.   If   you have   any   questions   or   concerns,   please   call   our   Call   Centre   at 1-888-298-3336   between   8   AM   and   5   PM   (EST),   Monday   to Friday .  USAGE   HIST OR Y  W ater   Usage W ater   Use Elec.Usage Electric   Use Days Month  per   Day (kWh)   per   Day  0 10 31 06-24  0 7 3 84 30 07-24  0 7 20 606 31 08-24  0 6 16 486 31 09-24  0 12 1 1 646 61 1 1-24  0 6 16 490 30 12-24  0 8 18 565 31 01-25  0 1 13 413 31 02-25  0 7 14 390 28 03-25  0 6 13 390 31 04-25  0 7 13 393 30 05-25  0 7 15 476 31 06-25  0 7 23 702 30 07-25  $1 18.59 PREVIOUS   BALANCE  ($1 18.59) P A YMENT   07/16/2025  $0.00 BALANCE   FOR W ARD  CHARGES USAGE RA TE  YOUR   ELECTRICITY   CHARGES:  $21.33 On   Peak   Usage   0.158000   135.0000  $36.48 Of f   Peak   Usage   0.076000   480.0000  $10.86 Mid   Peak   Usage   0.122000   89.0000  $58.68 Delivery  $4.34 Regulatory   Charges  $131.69 ELECTRICITY   CHARGES   SUBT OT AL  $131.69 T OT AL   ELECTRICITY   CHARGES  W A TER   CHARGES:  $32.81 Cold   W ater   Consumption   4.687200   7.0000  $32.81 T OT AL   W A TER   CHARGES  $15.17 Utility   Sales   T ax   Recovery  $1.95 HST   86849   6845   R T0001  ($17.25) Ontario   Electricity   Rebate  $164.37 CURRENT   CHARGES   (Due   08/20/2025)  $164.37 T OT AL   AMOUNT   DUE  1.000000 kWh 702 702 1 00052297 00052999 MR 30 06/23/2025 07/23/2025 ELE:   P0101799  CU.MTR. 7 1 00000789 00000796 MR 30 06/23/2025 07/23/2025 WTR:   P0101800",
    "pages": 2
  },
  {
    "filename": "SG_aug25bill-1.jpg",
    "type": "image",
    "content": "3 SParoup August 2025 Bill\n, J OFF CE Account No. 8913125889\nEmpowering the Future of Energy\nTotal Amount Payable: $0.00\nMDM NATARAJAN JEYALAKSHMI\n29D COMPASSVALE ST payment Due: 20 Aug 2025\nSINGAPORE 544291\nThis is your tax invoice for\nLrdballale EL 291D COMPASSVALE ST #04-266\nIn 1 1 Il | 1 [ll 604-000827-00414-2347 SINGAPORE 544291\n— Billing Period Bill Date Account Type Deposit\n— 06 Jul 2025 - 05 Aug 2025 06 Aug 2025 Domestic $100.00\nCurrent Charges Consumption Trend Total |\n(kwh) ----433\n% Electricity Services $45.60\nUsage: 166 kWh\nMAR APR* MAY JUN Jur AUG\nUsage 173 179 93 16 10 166.\nEEE EY\n—62\n_— A Gas Services $14.93\nby City Energy Pte. Ltd. (as Trustee EEE EE\nof City Energy Trust)\nUsage: 67 kWh MAR APR* MAY, JUN Ju AUG\nUsage 162 141 8 0 46 67\nI~ {cum 177\na — 150\n® Water Services $18.44\nby Public Utilities Board\nUsage: 57 CuM\nMAR APR* MAY JUN® Jur AUG*\nUsage 217 192 45 126 11 57\n---- Neighbour average —— National average *Estimated month\nUtilities Saving Tip\npoy Refuse Removal $9.36\nOn Brush teeth using a mug instead of running water. by SembWaste Pte Ltd .\nI Find out more utilities saving tips at WWWw.spgroup.com.sg GST $7.94\nCurrent Charges:\n(inclusive of GST) “ $96.27\nSP Services Ltd: Co. Registration No. (199504470N] | GST Registration No. (M2-8920920-4) For details on difference between current charges\nand total amount payable, see Summary of Charges 2\nFor cheque payment: Crossed cheque is to be made Payment Due: Total Amount Payable:\npayable to ‘SP Services Ltd\". Please detach and mail this 20 A 202 0 00\nportion with your cheque to 'SP Services Ltd, Privy Box\nNo. 920277, Singapore 929292\" (No receipt will be ug 5 S *\nissued. Please do not send post-dated cheque.) Please make full payment by the due date to avoid $0.50 Pink Notice Fee and 1% Late Payment Charge.\nBorsizsees\n8913125889 oooooooooooo\n41840352558-/S Page 10f 2 604-000827-00414-2347",
    "pages": 1
  },
  {
    "filename": "SG_aug25bill-2.jpg",
    "type": "image",
    "content": "August 2025 Bill\nAccount No. 8913125889\nSummary of Charges\nBalance Brought Forward from Previous Bill -$98.78\nPayment Received $0.00\nOutstanding Balance -$98.78\nCurrent Charges due on 20 Aug 2025 (Wed) $96.27\nThis amount will be used to offset your next bill -$2.51\nSummary of U-Save\nOpening Balance -$72.28\nU-Save Used $72.28\nClosing Balance $0.00\nBreakdown of Current Charges Usage Rate ($) Amount ($) Total ($)\n# Electricity Services\nMeter Reading taken : 313 166 kWh 0.2747 45.60 45.60\nGas Services by City Energy Pte. Ltd. (as Trustee of City Energy\n6 Trust)\nUsage estimated 67 kWh 0.2228 14.93 14.93\n& Water Services by Public Utilities Board\nUsage estimated 57CuM 1.4300 8.15\nWaterborne Tax 57CuM 1.0900 6.21\nWater Conservation Tax $8.15 50% 4.08 18.44\nU Refuse Removal by SembWaste Pte Ltd 1Qty 9.36 9.36 9.36\nSubtotal 88.33 88.33\nGST $88.33 9% 7.94 7.94\nCurrent Charges:\n(inclusive of GST) $96.27\n5 Meter Reading\n® Your meter reading(s) will be taken between 31 Aug 2025 and 06 Sep 2025.\n[= Notices\n® Payment received on or after 05 Aug 2025 may not be included in this bill.\n[2] Contact Information\n[EFM Scan here to update your k ee oe x 001s HDB HB pl noi\n7 al b: contact details and access 3 9 Vo 2 # Electricity: 1800 778 8888\nae, ; Biz Three Lift Lobby 1, Singapore 310490\n3 more e-services on the SP 4 Water: 1800 225 5782 (CALL PUB\nEH app. General Enquiries: 1800 222 2333 ater: ( )\n¢, Payment Arrangement: 6671 7100 4 Gas: 1800 752 1800\nThis bill serves as a tax invoice for the collection of:\n- Electricity charges for SP Services Ltd and SP PowerAssets Ltd (200302108D) or Tuas Power Supply Pte Ltd (200004985K] or Sembcorp Power Pte Ltd (199707557R) or Singapore Institute of Technology (200917667D)\n- Gas charges for City Energy Pte. Ltd. (as Trustee of City Energy Trust) [M30356440A)\n- Water charges, NEWater charges, water conservation tax and waterborne tax for the Public Utilities Board (MB-8100014-4)\n- Refuse removal fee for SembWaste Pte Ltd (M2-8922032-1) or Veolia ES Singapore P L (199804675H) or Colex Environmental Pte Ltd (201133348M) or 800 Super Waste Management Pte Ltd (M2-0073013-5) or TEE Environmental Pte.\nLtd. (200106873W) or ALBA W&H SmartCity Pte Ltd (201938124E)\n- Chilled Water charges for SP Home Cooling Pte. Ltd. (201924654M)\nThe amount for GST shown on the bill is calculated based on the sum of the GST charged for each individual item.\nDifferent payment options with SP Services\nGIRO PayNow QR Self Help Machines\neGl R® Set up eGIRO via SP app or Generate a GR code unique to your eA\nSP Utilties Portal. account on the SP app or at our SP 5\nUtilities Portal to pay your bill.\ni Counter Payment\nSPapp oo. Internet Banking m Cash, NETS, CashCard payments\nView and pay your bills via the app. Select \"SP Services\" as the Billing ho Sood §\nOrganisation at your bank's portal. SAnREmRCE ALTE eV En SITES.\n. Debit/Credit cards\n(VISA, MasterCard, AMEX)\nFind out other payment options at WWWw.spgroup.com.sg\nWe may, from time to time, contact you to obtain feedback or inform you about the services and offers of SP Services and its trusted partners. If you do not wish to be contacted, please inform us. Please visit www.spgroup.com.sg\nto read our T&Cs.\n41840352558-/S Page 2 of 2 604-000828-00414-2347",
    "pages": 1
  },
  {
    "filename": "orlandowaterbill.jpeg",
    "type": "image",
    "content": "Tus Et\nSummary of Charges — =\n~ ERVICE ADDRE 436 ALPINE\nJRRENT CHARGE $ & ad\nCharges Broakdown {Current Month) W El\nATER CONS MPTION $r F v iE\n| yea 2 ‘ 4 NE GR |\n8 151i\nTTT er ares un sewn an ax\neV RRGATIONUSAGE.\npNP :\n_a not RC oucE \\ 4\ntas : GRAY 1 AS °- \\ -\nea The Seminole County 2024 water Quality report is now | \\ i\nBe available on-line. The Seminole County Utilities Department | 3\nBe is excited to announce a new paper-free way to view the Meter Reading Information 8\nrad Annual Water Quality Report. Access the 2024 Water | From To Days Meter # Previous Current UsageX100| <i\ngE Quality Report by visiting | [0817/2025 0718/2025 31 85770145 2919 NTT 258 | 5\nSo www.seminolecountyfl.gov/2024WaterQualityReport J\n5% AUTO DRAFT - RETAIN ENTIRE PAGE FOR YOUR RECORDS.\nhs Summary of Charges Due 2\ni ACCOUNT NUMBER  123653-93834 TE\n2% CS SERVICE ADDRESS 436 ALPINE ST\n= = Fe He POBOKSIH BALANCE FORWARD $0.00\nra rons LAKE MARY, FL 321656443 CURRENT CHARGES ~~ $110.05 08/15/2025 a\nBs [TOTALDUE ~~ $110.05 | i\nz =] **AUTO DRAFT - DO NOT PAY** BS\n#2AUTO®=SCH 5-DIGIT 32701 3 PSS 154Y4DLAAR2-A-1 : Q\n1233 AY 0.588 my\nBt tL LC re re\n1 LE Lr Tre\nRAAB a AE getty] 2s\n436 ALPINE ST SEMINOLE COUNTY WATER AND SEWER UTILITY\nALTAMONTE SPRINGS FL 32701-7802 PO BOX 958443 a\nLAKE MARY FL 32795-8443\n7 Check here to i out change of address on reverse. 000123kL53000093834000011005",
    "pages": 1
  }
]